app/views/test_questions/review.html.haml

          .header.ui.center.aligned
            = @question.question_text.html_safe
        .extra.content
          .ui.sixteen.column.grid
            - @question.options.each do |option|
              .sixteen.wide.column.centered.aligned
---
SELECT "test_questions"."id" FROM "test_questions" WHERE "test_questions"."test_id" = $1  [["test_id", 10]]
SELECT "options".* FROM "options" WHERE "options"."question_id" = $1  [["question_id", 1]]