app/controllers/test_questions_controller.rb

  def show
    @question = @test_question.question
    test_questions_ids = TestQuestion.where(test_id: @test_question.test_id).pluck(:id).sort
    @first_question_id = test_questions_ids.first
---
SELECT "test_questions"."id" FROM "test_questions" WHERE "test_questions"."test_id" = $1  [["test_id", 3]]
SELECT  "test_questions".* FROM "test_questions" WHERE "test_questions"."id" = $1 ORDER BY "test_questions"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def review
    @test_question = TestQuestion.find(params[:id])
    @question = @test_question.question
    test_questions_ids = TestQuestion.where(test_id: @test_question.test_id).pluck(:id).sort
    @first_question_id = test_questions_ids.first
---
SELECT  "test_questions".* FROM "test_questions" WHERE "test_questions"."id" = $1 LIMIT $2  [["id", 113], ["LIMIT", 1]]
SELECT  "tests".* FROM "tests" WHERE "tests"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def user_response
    @test_question.update(user_response: params[:user_response])
---
UPDATE "test_questions" SET "user_response" = $1, "updated_at" = $2 WHERE "test_questions"."id" = $3  [["user_response", 2], ["updated_at", "2017-05-13 21:45:57.898826"], ["id", 33]]

    def set_test_question
      @test_question = TestQuestion.where(id: params[:id]).last
---
SELECT  "test_questions".* FROM "test_questions" WHERE "test_questions"."id" = $1 ORDER BY "test_questions"."id" DESC LIMIT $2  [["id", 33], ["LIMIT", 1]]