app/views/tests/index.html.haml

SELECT  "test_questions".* FROM "test_questions" WHERE "test_questions"."test_id" = $1 ORDER BY "test_questions"."id" ASC LIMIT $2  [["test_id", 10], ["LIMIT", 1]]
---
                  %td
                    = link_to "Review", review_test_question_path(test.test_questions.first.id), class: "ui huge primary button"